package org.comstudy21.ch01;

public class Ch01Ex11 {
	public static void main (String[] args){

		
		
	}
}

/*
 * IF문
 * 의미 : 조건1이 참이면 실행1을 하고 조건1이 거짓이면 실행1을 생략.
 * 조건에는 논리값이 들어간다.
 * if (조건1) {
 * 		실행1;
 * }
 * ---------------------
 * IF~ELSE
 * 의미 : 조건1이 참이면 실행1을 하고 조건1가 참이면 실행2를 한다.
 * 조건3이 참이면 실행 3을 하고 조건 n이 참이면 실행 n을 하고
 * 아무 것에도 조건이 맞지 않으면 else문 이하를 한다.
 * 
 * if(조건1) {
 * 		실행1;
 * }else if(조건2) {
 * 		실행2;
 *}
 *} else if(조건3){
 *		실행3;
 * }else if(조건n){
 * 		실행n;
 * }else {
 * 그밖의 실행;
 * }
 */





